:PROPERTIES:
:ID:       06278a18-c5ee-48fb-80af-422c748c610d
:LAST_MODIFIED: [2023-09-07 Thu 07:20]
:ROAM_REFS: [cite:@Operators2023]
:END:
#+title: Operators in C++
#+hugo_custom_front_matter: :slug "06278a18-c5ee-48fb-80af-422c748c610d"
#+author: Cash Prokop-Weaver
#+date: [2023-05-04 Thu 16:20]
#+filetags: :hastodo:concept:

* Indirection operator
:PROPERTIES:
:ID:       f9237075-e0c0-4edc-88ca-efcd846e6f5f
:ROAM_ALIASES: "Dereference operator"
:END:

The indirection, or dereference, operator is the asterisk (=*=).

#+begin_src C++
#include<iostream>

int foo() {
  int a = 5;
  int* b = &a;

  return *b;
}

int main() {
  std::cout << foo();
}

#+end_src

#+RESULTS:
: 5

